#include <iostream>// <- std::coutを使うために必要。
#include <format>// <- std::formatを使うために必要。
#include <print>// <- std::printlnを使うために必要。

int main()
{
	// 現代のC++では、文字の整形出力にstd::formatやstd::print/std::printlnを使うのが一般的です。

	// C言語では、文字の整形出力にはprintf系の関数が用意されていましたが、C++では使うべきではありません。
	// printf系の関数は型安全性についての致命的な問題があるからです。
	// 例えば
	// long long i = 1234567890123;
	// printf("i == %d\n", i);
	// というコードは、何のエラーも出さずに動いてしまいますが、実は正しく表示されません。
	// これは、printfの%dは32bit整数用であるにも関わらず、実際には64bit整数型であるlong long型の変数iを渡してしまっているためです。
	// 恐ろしいことにMSVC（Visual Studioのコンパイラ）では、エラーを出さないばかりか、iが32bitの範囲内に収まっている限りは正しく表示されてしまいます。
	// iが32bitの範囲を超えた途端に、突然表示が狂ってしまうのです。
	// このように、printf系の関数は、型の一致のチェックが満足に行われないため、バグの温床となります。

	// 昔のC++では<iomanip>を使った整形出力が使われていましたが、これも使うべきではありません。
	// 型安全でこそあれ、記述量が多く、非常に分かりにくい機能で、現代では最早廃れています。

	// 現在のC++では、std::format、std::print/std::printlnという非常に簡素で使いやすい機能が用意されました。
	// これらは上述のような型安全性の問題が解消され、かつフォーマット指定も混乱しにくくなっています。

	// 整数
	int i = 1;
	int j = 2;
	std::cout << "i == " << i << "\n";//昔ながらの方法です。std::coutに出力したい内容を「<<」で繋げていくことで、順に出力されます。
	//i == 1
	std::cout << std::format("i == {}\n", i);//std::formatを使うと、{}の中に変数の値を埋め込むことができます。
	//i == 1
	std::cout << std::format("i == {:0>3}\n", i);// 0埋め、右寄せ、3桁
	//i == 001

	// 複数の変数を埋め込むこともできます。1つ目の{}にはi、2つ目の{}にはjが入ります。
	std::cout << std::format("i == {:<3}, j == {:0>3}\n", i, j);// 1個目の{}:左寄せ、幅3、2個目の{}:右寄せ、0埋め、幅3
	//i == 1  , j == 002

	// 浮動小数点
	double d = 3.141592653589793;
	std::cout << std::format("pi == {}\n", d);// フォーマットなし
	//pi == 3.141592653589793
	std::cout << std::format("pi == {:>4.2f}\n", d);// 右寄せ、幅4、小数点以下2桁、fは指数表記をしないことの明示。
	//pi == 3.14

	// std::cout << std::formatを使う代わりに、std::printやstd::printlnを使うこともできます。
	std::println("pi == {:>6.4f}", d);//std::printlnは末尾に自動で改行（\n）を入れてくれます。
	//pi == 3.1416
	std::print("pi == {:>6.4f}\n", d);//std::printは末尾に改行を入れません。必要に応じて自分で\nを入れましょう。
	//pi == 3.1416

	char hello[] = "Hello";
	char world[] = "World";
	std::cout << std::format("{} {}!\n", hello, world);

	return 0;
}

/* 問題
int pl = 25;
int64_t rawid = 12345;
int ph = 220142;
double ax = 0.2446;
doulbe ay = -1.5907;
double x = 12605.2;
double y = 190451.0;
上記のような情報を持つBasetrackがあります。
このBasetrackの情報を、いずれも右寄せで、
pl:0埋め幅3、rawid:幅10、ph:幅6、axay:幅7で小数第4位まで、xyz:幅9で小数第1位まで
というフォーマットで表示させてみましょう。
次のように表示されたら正解です。
025      12345 220142  0.2446 -1.5907   12605.2  190451.0
*/